관리자/CM_003/Main.yml
config:
  target: "https://komscoverse-admin.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Warm-up phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - name: "Create Admin and log in"
    flow:
      - get:
          url: "/app/main/admin-ping"
          headers:
            sessionToken: "MGNmODg5M2VjMWQ4NmVkYzpMRkxiUTE5NjZqL3dsYUQwRGVqcW13PT0="  #임시 세션토큰입니다 어드민 로그인 하시고 재발급 받으셔야합니다.
          capture:
            json: "$"
            as: response
      - log: "{{response}}"